using System;
using Spectre.Console;

namespace Ketchup_Pomodoro.Services;

public static class HandleDrawArt
{
    public static void DrawLogo()
    {
        Console.Clear();

        AnsiConsole.MarkupLine(
            @"[red]
        ░█░█░█▀▀░█░░░█▀▀░█▀█░█▄█░█▀▀░░░▀█▀░█▀█░░
        ░█▄█░█▀▀░█░░░█░░░█░█░█░█░█▀▀░░░░█░░█░█░░
        ░▀░▀░▀▀▀░▀▀▀░▀▀▀░▀▀▀░▀░▀░▀▀▀░░░░▀░░▀▀▀░░
        ░█░█░█▀▀░▀█▀░█▀▀░█░█░█░█░█▀█░░░█▀█░█▀█░█▄█░█▀█░█▀▄░█▀█░█▀▄░█▀█
        ░█▀▄░█▀▀░░█░░█░░░█▀█░█░█░█▀▀░░░█▀▀░█░█░█░█░█░█░█░█░█░█░█▀▄░█░█
        ░▀░▀░▀▀▀░░▀░░▀▀▀░▀░▀░▀▀▀░▀░░░░░▀░░░▀▀▀░▀░▀░▀▀▀░▀▀░░▀▀▀░▀░▀░▀▀▀
        [/]"
        );
    }
}
